[
  {
    "type": "text",
    "text": "[25] Ali Humadi, Sulaf Dawood, Klas Halldin, and Brian Freeman. Rsa in spine: a review. Global Spine Journal, 7(8): 811-820, 2017. 2\n[26] Ludovic Humbert, Jacques A De Guise, Benjamin Aubert, Benoît Godbout, and Wafa Skalli. 3d reconstruction of the spine from biplanar x-rays using parametric models based on transversal and longitudinal inferences. Medical engineering & physics, 31(6):681-687, 2009. 2\n[27] Catalin Ionescu, Dragos Papava, Vlad Olaru, and Cristian Sminchisescu. Human3.6m: Large scale datasets and predictive methods for 3d human sensing in natural environments. IEEE Transactions on Pattern Analysis and Machine Intelligence, 36(7):1325-1339, 2014. 2, 3, 4, 8\n[28] Tao Jiang, Peng Lu, Li Zhang, Ningsheng Ma, Rui Han, Chengqi Lyu, Yining Li, and Kai Chen. Rtmpose: Real-time multi-person pose estimation based on mm, 2023. 6\n[29] Craig C Kage, Mohsen Akbari-Shandiz, Mary H Foltz, Rebekah L Lawrence, Taycia L Brandon, Nathaniel E Helwig, and Arin M Ellingson. Validation of an automated shape-matching algorithm for biplane radiographic spine osteokinematics and radiostereometric analysis error quantification. PLoS One, 15(2):e0228594, 2020. 2\n[30] Ibrahim A Kapandji. The physiology of the joints, volume i, upper limb. American Journal of Physical Medicine & Rehabilitation, 50(2):96, 1971. 1\n[31] Muhammad Saif Ullah Khan, Stephan Krauß, and Didier Stricker. Towards unconstrained 2d pose estimation of the human spine. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) Workshops, pages 6171-6180, 2025. 2, 3, 4, 6\n[32] Dong Suk Kim, Shi Hwan Park, Tae Sik Goh, Seung Min Son, and Jung Sub Lee. A meta-analysis of gait in adolescent idiopathic scoliosis. Journal of Clinical Neuroscience, 81: 196-200, 2020. 2\n[33] Kang Cheol Kim, Hyun Cheol Cho, Tae Jun Jang, Jong Mun Choi, and Jin Keun Seo. Automatic detection and segmentation of lumbar vertebrae from x-ray images for compression fracture evaluation. Computer Methods and Programs in Biomedicine, 200:105833, 2021. 3\n[34] Michal Kozanek, Shaobai Wang, Peter G Passias, Qun Xia, Gang Li, Christopher M Bono, Kirkham B Wood, and Guoan Li. Range of motion and orientation of the lumbar facet joints in vivo. Spine, 34(19):E689-E696, 2009. 1\n[35] Kornelia Kulig, Robert F Landel, and Christopher M Powers. Assessment of lumbar spine kinematics using dynamic mri: a proposed mechanism of sagittal plane motion induced by manual posterior-to-anterior mobilization. Journal of Orthopaedic & Sports Physical Therapy, 34(2):57-64, 2004. 2\n[36] Seth J Kussow, Jared L Zitnay, Penny R Atkins, and Andrew E Anderson. Accuracy and reliability of synthetic computed tomography for model-based tracking of biplane videoradiography data: Sj kussow et al. Annals of Biomedical Engineering, pages 1-14, 2025. 3\n[37] Nikolas Lessmann, Bram Van Ginneken, Pim A De Jong, and Ivana Işgum. Iterative fully convolutional neural networks for automatic vertebra segmentation and identification. Medical image analysis, 53:142-155, 2019. 2",
    "page": 10,
    "text_zh": "[25] Ali Humadi、Sulaf Dawood、Klas Halldin 和 Brian Freeman。脊椎中的 RSA：文獻綜述。Global Spine Journal，7(8)：811-820，2017。2\n[26] Ludovic Humbert、Jacques A De Guise、Benjamin Aubert、Benoît Godbout 和 Wafa Skalli。使用基於橫斷面和縱向推論的參數模型從雙平面 X 光影像重建脊椎的 3D 模型。Medical Engineering & Physics，31(6)：681-687，2009。2\n[27] Catalin Ionescu、Dragos Papava、Vlad Olaru 和 Cristian Sminchisescu。Human3.6M：自然環境中人體 3D 感知的大規模資料集和預測方法。IEEE Transactions on Pattern Analysis and Machine Intelligence，36(7)：1325-1339，2014。2、3、4、8\n[28] Tao Jiang、Peng Lu、Li Zhang、Ningsheng Ma、Rui Han、Chengqi Lyu、Yining Li 和 Kai Chen。RTMPose：基於 MM 的實時多人姿態估計，2023。6\n[29] Craig C Kage、Mohsen Akbari-Shandiz、Mary H Foltz、Rebekah L Lawrence、Taycia L Brandon、Nathaniel E Helwig 和 Arin M Ellingson。雙平面放射學脊椎骨動學形狀匹配自動化演算法的驗證與放射立體測量分析誤差量化。PLoS One，15(2)：e0228594，2020。2\n[30] Ibrahim A Kapandji。關節的生理學，第 I 冊，上肢。American Journal of Physical Medicine & Rehabilitation，50(2)：96，1971。1\n[31] Muhammad Saif Ullah Khan、Stephan Krauß 和 Didier Stricker。邁向人類脊椎的無約束 2D 姿態估計。收錄於 IEEE/CVF 電腦視覺與模式辨識會議（CVPR）工作坊論文集，頁碼 6171-6180，2025。2、3、4、6\n[32] Dong Suk Kim、Shi Hwan Park、Tae Sik Goh、Seung Min Son 和 Jung Sub Lee。青少年特發性脊柱側凸的步態後設分析。Journal of Clinical Neuroscience，81：196-200，2020。2\n[33] Kang Cheol Kim、Hyun Cheol Cho、Tae Jun Jang、Jong Mun Choi 和 Jin Keun Seo。用於壓縮性骨折評估的 X 光影像腰椎自動檢測與分割。Computer Methods and Programs in Biomedicine，200：105833，2021。3\n[34] Michal Kozanek、Shaobai Wang、Peter G Passias、Qun Xia、Gang Li、Christopher M Bono、Kirkham B Wood 和 Guoan Li。體內腰椎小關節的活動範圍和方向。Spine，34(19)：E689-E696，2009。1\n[35] Kornelia Kulig、Robert F Landel 和 Christopher M Powers。使用動態 MRI 評估腰椎運動學：手動後前向動員引起的矢狀面運動的假設機制。Journal of Orthopaedic & Sports Physical Therapy，34(2)：57-64，2004。2\n[36] Seth J Kussow、Jared L Zitnay、Penny R Atkins 和 Andrew E Anderson。合成電腦斷層掃描用於雙平面攝影測量資料模型追蹤的準確性和可靠性：Sj Kussow 等。Annals of Biomedical Engineering，頁碼 1-14，2025。3\n[37] Nikolas Lessmann、Bram Van Ginneken、Pim A De Jong 和 Ivana Işgum。用於自動椎骨分割和識別的迭代全卷積神經網路。Medical Image Analysis，53：142-155，2019。2"
  },
  {
    "type": "text",
    "text": "[38] Christian Liebsch and Hans-Joachim Wilke. Basic biomechanics of the thoracic spine and rib cage. In Biomechanics of the Spine, pages 35-50. Elsevier, 2018. 2, 8\n[39] Cheng-Chung Lin, Tung-Wu Lu, Ting-Ming Wang, Chao-Yu Hsu, Shih-Jung Hsu, and Ting-Fang Shih. In vivo three-dimensional intervertebral kinematics of the subaxial cervical spine during seated axial rotation and lateral bending via a fluoroscopy-to-ct registration approach. Journal of biomechanics, 47(13):3310-3317, 2014. 2, 3\n[40] RM Lin, I-Ming Jou, and Chin-Yin Yu. Lumbar lordosis: normal adults. Journal of the Formosan Medical Association = Taiwan yi zhi, 91(3):329-333, 1992. 5\n[41] Sara Lindenmann, Christos Tsagkaris, Mazda Farshad, and Jonas Widmer. Kinematics of the cervical spine under healthy and degenerative conditions: a systematic review. Annals of Biomedical Engineering, 50(12):1705-1733, 2022. 2\n[42] Filipa Lino, Carlos Santiago, and Manuel Marques. Benchmarking 3d human pose estimation models under occlusions. arXiv preprint arXiv:2504.10350, 2025. 3\n[43] Ao Liu, Nan-Hai Qiu, Xue-Ren Zhong, Xiang Fang, Jian-Jian Liao, Zhi-Peng Zhang, Pei-Feng Zheng, Yong-Yu Hu, Kong-He Hu, Ying-Hui Xiong, et al. Dynamic evaluation of the cervical spine by kinematic mri in patients with cervical spinal cord injury without fracture and dislocation. Journal of Orthopaedic Surgery and Research, 18(1):249, 2023. 2\n[44] Ilya Loshchilov and Frank Hutter. Decoupled weight decay regularization. arXiv preprint arXiv:1711.05101, 2017. 7\n[45] Oliver Ludwig, Carlo Dindorf, Jens Kelm, Steven Simon, Felix Nimmrichter, and Michael Fröhlich. Reference values for sagittal clinical posture assessment in people aged 10 to 69 years. International Journal of Environmental Research and Public Health, 20(5):4131, 2023. 8\n[46] Julieta Martinez, Rayat Hossain, Javier Romero, and James J Little. A simple yet effective baseline for 3d human pose estimation. In Proceedings of the IEEE international conference on computer vision, pages 2640-2649, 2017. 3, 7\n[47] Soroush Mehraban, Vida Adeli, and Babak Taati. Motionagformer: Enhancing 3d human pose estimation with a transformer-gcnformer network. In Proceedings of the IEEE/CVF winter conference on applications of computer vision, pages 6920-6930, 2024. 3\n[48] Elias Melhem, Ayman Assi, Rami El Rachkidi, and Ismat Ghanem. Eos® biplanar x-ray imaging: concept, developments, benefits, and limitations. Journal of children's orthopaedics, 10(1):1-14, 2016. 2, 8\n[49] Giulia Michelini, Antonella Corridore, Silvia Torlone, Federico Bruno, Claudia Marsecano, Raffaella Capasso, Federando Caranci, Antonio Barile, Carlo Masciocchi, and Alessandra Splendiani. Dynamic mri in the evaluation of the spine: state of the art. Acta Bio Medica: Atenei Parmensis, 89(Suppl 1):89, 2018. 2\n[50] Jonathan D Mortensen, Anita N Vasavada, and Andrew S Merryweather. The inclusion of hyoid muscles improve moment generating capacity and dynamic simulations in musculoskeletal models of the head and neck. PloS one, 13(6): e0199912, 2018. 3",
    "page": 10,
    "text_zh": "[38] Christian Liebsch and Hans-Joachim Wilke. 胸椎和肋骨籠的基本生物力學。在脊椎生物力學中，第35-50頁。Elsevier，2018。2，8"
  },
  {
    "type": "text",
    "text": "[51] Donald A Neumann. Kinesiology of the musculoskele-\ntal system: foundations for rehabilitation. *Mosby Elsevier,*\n2010. 1, 2\n[52] Itaru Oda, Kuniyoshi Abumi, Bryan W Cunningham,\nKiyoshi Kaneda, and Paul C McAfee. An in vitro human ca-\ndaveric study investigating the biomechanical properties of\nthe thoracic spine. *Spine,* 27(3):E64-E70, 2002. 1, 2\n[53] David Pagnon, Mathieu Domalain, and Lionel Reveret.\nPose2sim: an end-to-end workflow for 3d markerless sports\nkinematics—part 2: accuracy. *Sensors,* 22(7):2712, 2022. 3,\n4\n[54] Dario Pavllo, Christoph Feichtenhofer, David Grangier, and\nMichael Auli. 3d human pose estimation in video with tem-\nporal convolutions and semi-supervised training. In *Proceed-\nings of the IEEE/CVF conference on computer vision and\npattern recognition*, pages 7753–7762, 2019. 3\n[55] Mark Pearcy, IAN Portek, and Janis Shepherd. Three-\ndimensional x-ray analysis of normal movement in the lum-\nbar spine. *Spine,* 9(3):294–297, 1984. 8\n[56] Mark J Pearcy. Stereo radiography of lumbar spine motion.\n*Acta Orthopaedica Scandinavica*, 56(sup212):1–45, 1985. 8\n[57] Zizhao Peng, Zihan Wang, Mengying Sun, Zheng Lv, Yan\nWang, Ping Li, and Fengwei An. Graph convolutional net-\nworks for 3d skeleton-based scoliosis screening using gait\nsequences: Z. peng et al. *The Visual Computer*, pages 1–13,\n2025. 2\n[58] Hieu Huy Pham, H Nguyen Trung, and Ha Quy Nguyen.\nVindr-spinexr: A large annotated medical image dataset for\nspinal lesions detection and classification from radiographs.\n*PhysioNet*, pages RRID-SCR.007345, 2021. 3\n[59] Apoorva Rajagopal, Christopher L Demia, Matthew S De-\nMers, Denny D Delp, Jennifer L Hicks, and Scott L Delp.\nFull-body musculoskeletal model for muscle-driven simula-\ntion of human gait. *IEEE transactions on biomedical engi-\nneering*, 63(10):2068–2079, 2016. 3, 4\n[60] Alexandra Rören, Robin Ogiez, Laurent Gajny, Aurore\nBlasco, Fadila Mihoubi Bouvier, Antoine Feydy, François\nRannou, Marie-Martine Lefèvre-Colau, and Agnès Roby-\nBrami. Arm elevation involves changes in the whole spine:\nan exploratory study using eos imaging. *BMC Musculoskele-\ntal Disorders*, 25(1):993, 2024. 4, 5\n[61] Adam Rozumalski, Michael H Schwartz, Roy Wervey, An-\ndrew Swanson, Daryll C Dykes, and Tom Novacheck. The\nin vivo three-dimensional motion of the human lumbar spine\nduring gait. *Gait & posture*, 28(3):378–384, 2008. 1\n[62] Janis Savlovskis. Range of the motion (rom) of the cervi-\ncal, thoracic and lumbar spine in the traditional anatomical\nplanes. *Anatomy Standard*, 2020. 5\n[63] Stefan Schmid, Katelyn A Burkhart, Brett T Allaire, Daniel\nGrindle, and Dennis E Anderson. Musculoskeletal full-body\nmodels including a detailed thoracolumbar spine for children\nand adolescents aged 6–18 years. *Journal of biomechanics,*\n102:109305, 2020. 3\n[64] Anjany Sekuboyina, Malek E Husseini, Amirhossein Bayat,\nMaximilian Löffler, Hans Liebl, Hongwei Li, Giles Tetteh,\nJan Kukačka, Christian Payer, Darko Štern, et al. Verse: a\nvertebrae labelling and segmentation benchmark for multi",
    "page": 11,
    "text_zh": "[51] Donald A Neumann. 肌肉骨骼系統運動學：復健基礎。*Mosby Elsevier,*\n2010. 1, 2\n[52] Itaru Oda, Kuniyoshi Abumi, Bryan W Cunningham,\nKiyoshi Kaneda, and Paul C McAfee. 胸椎生物力學特性的體外人類屍體研究。*Spine,* 27(3):E64-E70, 2002. 1, 2\n[53] David Pagnon, Mathieu Domalain, and Lionel Reveret.\nPose2sim：運動無標記三維運動學的端到端工作流程—第 2 部分：準確度。*Sensors,* 22(7):2712, 2022. 3,\n4\n[54] Dario Pavllo, Christoph Feichtenhofer, David Grangier, and\nMichael Auli. 使用時間卷積和半監督訓練的影片中三維人體姿態估計。在 *IEEE/CVF 電腦視覺與模式識別會議論文集*，頁碼 7753–7762，2019. 3\n[55] Mark Pearcy, IAN Portek, and Janis Shepherd. 腰椎正常運動的三維 X 光分析。*Spine,* 9(3):294–297, 1984. 8\n[56] Mark J Pearcy. 腰椎運動的立體放射線照相。\n*Acta Orthopaedica Scandinavica*, 56(sup212):1–45, 1985. 8\n[57] Zizhao Peng, Zihan Wang, Mengying Sun, Zheng Lv, Yan\nWang, Ping Li, and Fengwei An. 使用步態序列進行基於三維骨架的脊柱側凸篩檢的圖卷積網路：Z. Peng 等人。*The Visual Computer*, 頁碼 1–13, 2025. 2\n[58] Hieu Huy Pham, H Nguyen Trung, and Ha Quy Nguyen.\nVindr-spinexr：用於放射線影像脊椎病變檢測和分類的大規模標註醫學影像資料集。*PhysioNet*, 頁碼 RRID-SCR.007345, 2021. 3\n[59] Apoorva Rajagopal, Christopher L Demia, Matthew S De-\nMers, Denny D Delp, Jennifer L Hicks, and Scott L Delp.\n用於肌肉驅動人類步態模擬的全身肌肉骨骼模型。*IEEE 生物醫學工程交易*, 63(10):2068–2079, 2016. 3, 4\n[60] Alexandra Rören, Robin Ogiez, Laurent Gajny, Aurore\nBlasco, Fadila Mihoubi Bouvier, Antoine Feydy, François\nRannou, Marie-Martine Lefèvre-Colau, and Agnès Roby-\nBrami. 手臂抬起涉及整個脊椎的變化：使用 EOS 影像的探索性研究。*BMC 肌肉骨骼疾病*, 25(1):993, 2024. 4, 5\n[61] Adam Rozumalski, Michael H Schwartz, Roy Wervey, An-\ndrew Swanson, Daryll C Dykes, and Tom Novacheck. 人類步行時腰椎的體內三維運動。*步態與姿勢*, 28(3):378–384, 2008. 1\n[62] Janis Savlovskis. 傳統解剖平面中頸椎、胸椎和腰椎的運動範圍 (ROM)。*解剖學標準*, 2020. 5\n[63] Stefan Schmid, Katelyn A Burkhart, Brett T Allaire, Daniel\nGrindle, and Dennis E Anderson. 包含詳細胸腰椎的 6–18 歲兒童和青少年全身肌肉骨骼模型。*生物力學期刊*, 102:109305, 2020. 3\n[64] Anjany Sekuboyina, Malek E Husseini, Amirhossein Bayat,\nMaximilian Löffler, Hans Liebl, Hongwei Li, Giles Tetteh,\nJan Kukačka, Christian Payer, Darko Štern, et al. VERSE：多"
  },
  {
    "type": "text",
    "text": "detector ct images. Medical image analysis, 73:102166, 2021. 2, 3\n[65] Jeremy D Shaw, Daniel L Shaw, Daniel R Cooperman, Jason D Eubanks, Ling Li, and David H Kim. Characterization of lumbar spinous process morphology: a cadaveric study of 2,955 human lumbar vertebrae. The Spine Journal, 15(7):1645-1652, 2015. 1, 2\n[66] Tomasz Sipko, Katarzyna Barczyk-Pawelec, Mirela Piksa, and Joanna Mencel. Impact of standing and sitting positions on spinal curvature and muscle mechanical properties in young women: A photogrammetric and myotonpro analysis. Medical Science Monitor: International Medical Journal of Experimental and Clinical Research, 30:e944930-1, 2024. 4, 5\n[67] Ke Sun, Bin Xiao, Dong Liu, and Jingdong Wang. Deep high-resolution representation learning for human pose estimation. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 5693-5703, 2019. 6\n[68] A Tafazzol, N Arjmand, Aboulfazl Shirazi-Adl, and M Parzinianpour. Lumbopelvic rhythm during forward and backward sagittal trunk rotations: combined in vivo measurement with inertial tracking device and biomechanical modeling. Clinical Biomechanics, 29(1):7-13, 2014. 8\n[69] Christos Tsagkaris, Jonas Widmer, Florian Wanivenhaus, Andrea Redaelli, Claudio Lamartina, and Mazda Farshad. The sitting vs standing spine. North American Spine Society Journal (NASSJ), 9, 100108, 2022. 4, 5\n[70] Keenon Werling, Nicholas A Bianco, Michael Raitor, Jon Stingel, Jennifer L Hicks, Steven H Collins, Scott L Delp, and C Karen Liu. Addbiomechanics: Automating model scaling, inverse kinematics, and inverse dynamics from human motion data through sequential optimization. Plos one, 18(11):e0295152, 2023. 3\n[71] AUGUSTUS A WHITE III. Clinical biomechanics of cervical spine implants. Spine, 14(10):1040-1045, 1989. 1\n[72] AUGUSTUS A WHITE III and Manohar M Panjabi. The basic kinematics of the human spine: a review of past and current knowledge. Spine, 3(1):12-20, 1978. 5\n[73] Qun Xia, Shaobai Wang, Peter G Passias, Michal Kozanek, Gang Li, Brian E Grottkau, Kirkham B Wood, and Guoan Li. In vivo range of motion of the lumbar spinous processes. European Spine Journal, 18(9):1355-1362, 2009. 1\n[74] Yufei Xu, Jing Zhang, Qiming Zhang, and Dacheng Tao. VIOPose: Simple vision transformer baselines for human pose estimation. In Advances in Neural Information Processing Systems, 2022. 6\n[75] Mattia Zappalá, Stephen Lightbourne, and Nicola R Heneghan. The relationship between thoracic kyphosis and age, and normative values across age groups: a systematic review of healthy adults. Journal of orthopaedic surgery and research, 16(1):447, 2021. 8\n[76] Yaqi Zhang, Yan Lu, Bin Liu, Zhiwei Zhao, Qi Chu, and Nenghai Yu. Evopose: A recursive transformer for 3d human pose estimation with kinematic structure priors. In ICASSP 2023-2023 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), pages 1-5. IEEE, 2023. 3",
    "page": 11,
    "text_zh": "檢測器 CT 影像。Medical image analysis，73:102166，2021。2, 3\n[65] Jeremy D Shaw、Daniel L Shaw、Daniel R Cooperman、Jason D Eubanks、Ling Li 及 David H Kim。腰椎棘突形態學特徵描述：2,955 具人類腰椎的屍體研究。The Spine Journal，15(7):1645-1652，2015。1, 2\n[66] Tomasz Sipko、Katarzyna Barczyk-Pawelec、Mirela Piksa 及 Joanna Mencel。站姿和坐姿對年輕女性脊椎曲率和肌肉機械性質的影響：攝影測量法和 Myotonpro 分析。Medical Science Monitor: International Medical Journal of Experimental and Clinical Research，30:e944930-1，2024。4, 5\n[67] Ke Sun、Bin Xiao、Dong Liu 及 Jingdong Wang。用於人類姿態估計的深層高解析度表徵學習。在 IEEE 電腦視覺與模式識別會議論文集，第 5693-5703 頁，2019。6\n[68] A Tafazzol、N Arjmand、Aboulfazl Shirazi-Adl 及 M Parzinianpour。前向和後向矢狀面軀幹旋轉中的腰骨盆節奏：結合慣性追蹤裝置的體內測量與生物力學模型。Clinical Biomechanics，29(1):7-13，2014。8\n[69] Christos Tsagkaris、Jonas Widmer、Florian Wanivenhaus、Andrea Redaelli、Claudio Lamartina 及 Mazda Farshad。坐姿與站姿脊椎的比較。North American Spine Society Journal (NASSJ)，9, 100108，2022。4, 5\n[70] Keenon Werling、Nicholas A Bianco、Michael Raitor、Jon Stingel、Jennifer L Hicks、Steven H Collins、Scott L Delp 及 C Karen Liu。AddBiomechanics：通過序列最佳化從人類運動資料自動化模型縮放、反向運動學和反向動力學。Plos one，18(11):e0295152，2023。3\n[71] AUGUSTUS A WHITE III。頸椎植入物的臨床生物力學。Spine，14(10):1040-1045，1989。1\n[72] AUGUSTUS A WHITE III 及 Manohar M Panjabi。人類脊椎的基本運動學：過去與現代知識的回顧。Spine，3(1):12-20，1978。5\n[73] Qun Xia、Shaobai Wang、Peter G Passias、Michal Kozanek、Gang Li、Brian E Grottkau、Kirkham B Wood 及 Guoan Li。腰椎棘突的體內活動範圍。European Spine Journal，18(9):1355-1362，2009。1\n[74] Yufei Xu、Jing Zhang、Qiming Zhang 及 Dacheng Tao。VIOPose：用於人類姿態估計的簡單 Vision Transformer 基線。在神經資訊處理系統進展，2022。6\n[75] Mattia Zappalá、Stephen Lightbourne 及 Nicola R Heneghan。胸椎後凸與年齡之間的關係及各年齡組的標準值：健康成人的系統性文獻回顧。Journal of orthopaedic surgery and research，16(1):447，2021。8\n[76] Yaqi Zhang、Yan Lu、Bin Liu、Zhiwei Zhao、Qi Chu 及 Nenghai Yu。Evopose：具有運動學結構先驗的人類三維姿態估計遞迴 Transformer。在 ICASSP 2023-2023 IEEE 聲學、語音及信號處理國際會議(ICASSP)，第 1-5 頁。IEEE，2023。3"
  },
  {
    "type": "text",
    "text": "[77] Zirui Zhou, Junhao Liang, Zizhao Peng, Chao Fan, Fengwei An, and Shiqi Yu. Gait patterns as biomarkers: A video-based approach for classifying scoliosis. In *International Conference on Medical Image Computing and Computer-Assisted Intervention*, pages 284-294. Springer, 2024. 2, 3\n[78] Wentao Zhu, Xiaoxuan Ma, Zhaoyang Liu, Libin Liu, Wayne Wu, and Yizhou Wang. Motion-buffer: A unified perspective on learning human motion representations. In *Proceedings of the IEEE/CVF international conference on computer vision*, pages 15085-15099, 2023. 3\n[79] Xiaojia Zhu, Rui Chen, Zhiwen Shao, Ming Zhang, Yuhu Dai, Wenzhi Zhang, and Chuandong Lang. Mgscoliosis: Multi-grained scoliosis detection with joint ordinal regression from natural image. *Alexandria Engineering Journal*, 111:329-340, 2025. 3",
    "page": 12,
    "text_zh": "[77] Zirui Zhou, Junhao Liang, Zizhao Peng, Chao Fan, Fengwei An, and Shiqi Yu. Gait patterns as biomarkers: A video-based approach for classifying scoliosis. In *國際醫學影像計算與電腦輔助介入會議*, pages 284-294. Springer, 2024. 2, 3"
  }
]