[
  {
    "type": "text",
    "text": "[21] MAA. Aime 2024 benchmark: Problems from the american invitational mathematics examination. https://huggingface.co/datasets/Maxwell-Jia/AIME_2024, 2024. Benchmark of AIME 2024 problems for evaluating mathematical reasoning in language models. 7\n[22] MAA. Aime 2025 benchmark: Problems from the american invitational mathematics examination. https://ukgovernmentbeis.github.io/inspect_evals/evals/mathematics/aime2025/, 2025. Benchmark of AIME 2025 problems for evaluating mathematical reasoning in language models. 7\n[23] Dirk Merkel. Docker: lightweight linux containers for consistent development and deployment. In Linux Journal, number 239. Belltown Media, 2014. 4\n[24] Mike A Merrill, Alexander G Shaw, Nicholas Carlini, Boxuan Li, Harsh Raj, Ivan Bercovich, Lin Shi, Jeong Yeon Shin, Thomas Walshe, E Kelly Buchanan, et al. Terminal-bench: Benchmarking agents on hard, realistic tasks in command line interfaces. arXiv preprint arXiv:2601.11868, 2026. 2, 3\n[25] MiniMax. Minimax m2 & agent: Ingenious in simplicity. https://www.minimax.io/news/minimax-m2, 2025. 2\n[26] Arindam Mitra, Luciano Del Corro, Guoqing Zheng, Shweti Mahajan, Dany Rouhana, Andres Codas, Yadong Lu, Wei-ge Chen, Olga Vrousgos, Corby Rosset, et al. Agentinstruct: Toward generative teaching with agentic flows. arXiv preprint arXiv:2407.03502, 2024. 3\n[27] Moonshot AI. Introducing kimi k2 thinking. https://moonshotai.github.io/Kimi-K2/thinking.html, Nov 2025. 2\n[28] Ivan Moshkov, Darragh Hanley, Ivan Sorokin, Shubham Toshniwal, Christof Henkel, Benedikt Schifferer, Wei Du, and Igor Gitman. Aimo-2 winning solution: Building state-of-the-art mathematical reasoning models with openmathreasoning dataset. arXiv preprint arXiv:2504.16891, 2025. 5\n[29] Mux. Terminal benchmarking. https://mux CODER. co/refer e nce/b en ch markin g, 2025. 2, 3\n[30] Jack Nichols. How we scored #1 on terminal-bench (52%). https://www.warp.dev/blog/terminal-bench, 2025. 2, 3\n[31] OpenAI. Introducing Swe-bench verified. https://openai.com/index/introducing-swe-bench-verified/, Aug 2024. 7\n[32] OpenAI. Introducing Codex. https://openai.com/index/introducing-codex/, May 2025. Overview of the Codex coding agent accessible via ChatGPT and related clients. 1, 3\n[33] OpenAI. Introducing GPT-2. https://openai.com/index/introducing-gpt-5-2/, 2025. 2\n[34] Bowen Peng, Jeffrey Quesnelle, Honglu Fan, and Enrico Shippole. Yarn: Efficient context window extension of large language models. arXiv preprint arXiv:2309.00071, 2023. 10\n[35] Xiaoxuan Peng, Xinyu Lu, Kaiqi Zhang, Taosong Fang, Boxi Cao, and Yaojie Lu. Litecoder-terminal: Lightweight terminal agents with <1k synthesized trajectories. https://huggingface.co/blog/Lite-Coder/litecoder-terminal-summary, 2025. 2, 3, 7\n[36] Alex Shaw. Harbor Framework, November 2025. URL https://github.com/laude-institute/harbor. 8\n[37] Guangming Sheng, Chi Zhang, Zilingfeng Ye, Xibin Wu, Wang Zhang, Ru Zhang, Yanghua Peng, Haibin Lin, and Chuan Wu. Hybridflow: A flexible and efficient rlhf framework. arXiv preprint arXiv: 2409.19256, 2024. 8",
    "page": 13
  }
]