[
  {
    "type": "text",
    "text": "[26] Zitian Huang, Yikuan Yu, Jiawen Xu, Feng Ni, and Xinyi Le. PF-Net: Point Fractal Network for 3D Point Cloud Completion. In IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pages 7662-7670, 2020. 2\n[27] Ka-Hei Hui, Ruihui Li, Jingyu Hu, and Chi-Wing Fu. Neural wavelet-domain diffusion for 3D shape generation. In Proceedings of SIGGRAPH Asia, pages 1-9, 2022. 2\n[28] Ka-Hei Hui, Ruihui Li, Jingyu Hu, and Chi-Wing Fu. Neural template: Topology-aware reconstruction and disentangled generation of 3D meshes. In IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pages 18572-18582, 2022. 2\n[29] Shun Iwase, Katherine Liu, Vitor Guizilini, Adrien Gaidon, Kris Kitani, Rareş Ambrus, and Sergey Zakharov. Zero-Shot Multi-Object Scene Completion. In ECCV, 2024. 1\n[30] Shun Iwase, Muhammad Zubair Irshad, Katherine Liu, Vitor Guizilini, Robert Lee, Takuya Ikeda, Amma Ayako, Koichi Nishiwaki, Kris Kitani, Rareş Ambruș, and Sergey Zakharov. ZeroGrasp: Zero-Shot Shape Reconstruction Enabled Robotic GrASPing. In CVPR, 2025. 1\n[31] Yoni Kasten, Ohad Rahamim, and Gal Chechik. Point Cloud Completion with Pretrained Text-to-image Diffusion Models. In Conference on Neural Information Processing Systems (NeurIPS), pages 12171-12191, 2023. 1, 3, 5, 6, 7\n[32] Jihun Kim, Hyeokjun Kwon, Yunseo Yang, and Kuk-Jin Yoon. Learning Point Cloud Completion without Complete Point Clouds: A Pose-aware Approach. In IEEE International Conference on Computer Vision (ICCV), pages 14157-14167, 2023. 2\n[33] Jeongsol Kim, Bryan Sangwoo Kim, and Jong Chul Ye. FlowDPS: Flow-Driven Posterior Sampling for Inverse Problems. In Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV), pages 12328-12337, 2025. 3\n[34] An Li, Zhe Zhu, and Mingqiang Wei. GenPC: Zero-shot Point Cloud Completion via 3D Generative Priors. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), pages 1308-1318, 2025. 1, 3, 5, 6\n[35] Shanshan Li, Pan Gao, Xiaoyang Tan, and Mingqiang Wei. ProxyFormer: Proxy Alignment Assisted Point Cloud Completion with Missing Part Sensitive Transformer. In IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pages 9466-9475, 2023. 2\n[36] Yangguang Li, Zi-Xin Zou, Zexiang Liu, Dehu Wang, Yuan Liang, Zhipeng Yu, Xingchao Liu, Yuan-Chen Guo, Ding Liang, Wanli Ouyang, et al. TripoSG: High-Fidelity 3D Shape Synthesis using Large-Scale Rectified Flow Models. arXiv preprint arXiv:2502.06608, 2025. 1\n[37] Yaron Lipman, David Levin, and Daniel Cohen-Or. Green Coordinates. ACM Transactions on Graphics, 27(3):1-10, 2008. 5, 7, 8\n[38] Mengya Liu, Ajad Chhatkuli, Janis Postels, Luc Van Gool, and Federico Tombari. Self-supervised Shape Completion via INVolution and Implicit Correspondences. In European Conference on Computer Vision (ECCV), pages 212-229, 2024. 2",
    "page": 10,
    "text_zh": "[26] Zitian Huang, Yikuan Yu, Jiawen Xu, Feng Ni, 和 Xinyi Le。PF-Net: Point Fractal Network for 3D Point Cloud Completion。IEEE 計算機視覺與模式識別會議（CVPR），第 7662-7670 頁，2020 年。2"
  },
  {
    "type": "text",
    "text": "[39] Ruoshi Liu, Rundi Wu, Basile Van Hoorick, Pavel Tokmakov, Sergey Zakharov, and Carl Vondrick. Zero-1-to-3: Zero-shot One Image to 3D Object. In IEEE International Conference on Computer Vision (ICCV), pages 9298-9309, 2023. 3\n[40] Zhengzhe Liu, Jingyu Hu, Ka-Hei Hui, Xiaojuan Qi, Daniel Cohen-Or, and Chi-Wing Fu. Exim: A hybrid explicit-implicit representation for text-guided 3D shape generation. ACM Transactions on Graphics (SIGGRAPH Asia), 42(6): 1-12, 2023. 2\n[41] Shitong Luo and Wei Hu. Diffusion Probabilistic Models for 3D Point Cloud Generation. In IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pages 2837-2845, 2021. 2\n[42] Zhaoyang Lyu, Zhifeng Kong, Xudong Xu, Liang Pan, and Dahua Lin. A Conditional Point Diffusion-R Efinement Paradigm for 3D Point Cloud Completion. In International Conference on Learning Representations (ICLR), 2022. 2\n[43] Mark Pauly, N iloy J Mitra, Joachim Giesen, Markus H Gross, and Leonidas J Guibas. Example-Based 3D Scan Completion. In Eurographics Symposium on Geometry Processing (SGP), 2005. 1\n[44] Mark Pauly, N iloy J Mitra, Johannes Wallner, Helmut Pottmann, and Leonidas J Guibas. Discovering Structural Regularity in 3D Geometry. In ACM Transactions on Graph-ics (SIGGRAPH), pages 1-11, 2008. 1\n[45] Songyou Peng, Chiyu \"Max\" Jiang, Yiyi Liao, Michael Niemeyer, Marc Pollefeys, and Andreas Geiger. Shape As Points: A Differentiable Poisson Solver. In Conference on Neural Information Processing Systems (NeurIPS), 2021. 5, 6\n[46] Robin Rombach, Andreas Blattmann, Dominik Lorenz, Patrick Esser, and Björn Ommer. High-Resolution Image Synthesis with Latent Diffusion Models. In IEEE Confer-ence on Computer Vision and Pattern Recognition (CVPR), pages 10684-10695, 2022. 3\n[47] Chao-Hui Shen, Hongbo Fu, Kang Chen, and Shi-Min Hu. Structure Recovery by Part Assembly. ACM Transactions on Graphics (SIGGRAPH), 31(6):1-11, 2012. 1\n[48] Minneapolis Sung, Vladimir G Kim, Roland Angst, and Leonidas Guibas. Data-driven Structural Priors for Shape Completion. ACM Transactions on Graphics (SIGGRAPH), 34(6):1-11, 2015. 1\n[49] Jiaxiang Tang, Zhaoxi Chen, Xiaokang Chen, Tengfei Wang, Gang Zeng, and Ziwei Liu. LGM: Large Multi-View Gaussian Model for High-Resolution 3D Content Creation. In European Conference on Computer Vision (ECCV), pages 1-18, 2024. 3\n[50] Sebastian Thrun and Ben Wegbreit. Shape from Symmetry. In IEEE International Conference on Computer Vision (ICCV), pages 1824-1831, 2005. 1\n[51] Jun Wang, Ying Cui, Dongyan Guo, Junxia Li, Qingshan Liu, and Chunhua Shen. PointAttN: You only Need Attention for Point Cloud Completion. In AAAI Conference on Artificial Intelligence (AAAI), pages 5472-5480, 2024. 2\n[52] Penghao Wang, Yiyang He, Xin Lv, Yukai Zhou, Lan Xu, Jingyi Yu, and Jiayuan Gu. PartNeXt: A Next-Generation",
    "page": 10,
    "text_zh": "[39] Ruoshi Liu, Rundi Wu, Basile Van Hoorick, Pavel Tokmakov, Sergey Zakharov, and Carl Vondrick. Zero-1-to-3: Zero-shot One Image to 3D Object. 在 IEEE 國際電腦視覺會議（ICCV），頁碼 9298-9309，2023。3\n\n[40] Zhengzhe Liu, Jingyu Hu, Ka-Hei Hui, Xiaojuan Qi, Daniel Cohen-Or, and Chi-Wing Fu. Exim: 用於文本引導 3D 形狀生成的混合顯式-隱式表示。ACM 圖形學交易（SIGGRAPH Asia），42(6)：1-12，2023。2\n\n[41] Shitong Luo and Wei Hu. 用於 3D 點雲生成的擴散機率模型。在 IEEE 電腦視覺與模式識別會議（CVPR），頁碼 2837-2845，2021。2\n\n[42] Zhaoyang Lyu, Zhifeng Kong, Xudong Xu, Liang Pan, and Dahua Lin. 用於 3D 點雲補全的條件點擴散-精化範式。在國際學習表示會議（ICLR），2022。2\n\n[43] Mark Pauly, Niloy J Mitra, Joachim Giesen, Markus H Gross, and Leonidas J Guibas. 基於例子的 3D 掃描補全。在 Eurographics 幾何處理研討會（SGP），2005。1\n\n[44] Mark Pauly, Niloy J Mitra, Johannes Wallner, Helmut Pottmann, and Leonidas J Guibas. 在 3D 幾何中發現結構規律性。ACM 圖形學交易（SIGGRAPH），頁碼 1-11，2008。1\n\n[45] Songyou Peng, Chiyu \"Max\" Jiang, Yiyi Liao, Michael Niemeyer, Marc Pollefeys, and Andreas Geiger. Shape As Points: 可微分的泊松求解器。在神經信息處理系統會議（NeurIPS），2021。5, 6\n\n[46] Robin Rombach, Andreas Blattmann, Dominik Lorenz, Patrick Esser, and Björn Ommer. 使用潛在擴散模型的高分辨率影像合成。在 IEEE 電腦視覺與模式識別會議（CVPR），頁碼 10684-10695，2022。3\n\n[47] Chao-Hui Shen, Hongbo Fu, Kang Chen, and Shi-Min Hu. 通過部分組裝進行結構恢復。ACM 圖形學交易（SIGGRAPH），31(6)：1-11，2012。1\n\n[48] Minneapolis Sung, Vladimir G Kim, Roland Angst, and Leonidas Guibas. 用於形狀補全的數據驅動結構先驗。ACM 圖形學交易（SIGGRAPH），34(6)：1-11，2015。1\n\n[49] Jiaxiang Tang, Zhaoxi Chen, Xiaokang Chen, Tengfei Wang, Gang Zeng, and Ziwei Liu. LGM: 用於高分辨率 3D 內容創建的大規模多視圖高斯模型。在歐洲電腦視覺會議（ECCV），頁碼 1-18，2024。3\n\n[50] Sebastian Thrun and Ben Wegbreit. 對稱性中的形狀。在 IEEE 國際電腦視覺會議（ICCV），頁碼 1824-1831，2005。1\n\n[51] Jun Wang, Ying Cui, Dongyan Guo, Junxia Li, Qingshan Liu, and Chunhua Shen. PointAttN: 點雲補全只需要注意力機制。在 AAAI 人工智慧會議（AAAI），頁碼 5472-5480，2024。2\n\n[52] Penghao Wang, Yiyang He, Xin Lv, Yukai Zhou, Lan Xu, Jingyi Yu, and Jiayuan Gu. PartNeXt: 下一代"
  }
]